

# ---------------------------------------------------------------------------
key = "Alice"
print(f"{key}")        #  打印内容是: Alice
print(f"{{}}")         # 类似于转义，打印内容是: {}
print(f"{{{key}}}")    #  打印内容是: {Alice}


# ---------------------------------------------------------------------------
# fstring 如何 转义

key = "Alice"
# 转义花括号
print(f"我的名字是 {{key}} ")         # 我的名字是 {key}

# 单个括号转义
print(f"我的名字是 {{ {key} }} ")     # 我的名字是 { Alice }
print(f"我的名字是 {key} ")           # 我的名字是 Alice
print(f"{{")                        # {
print(f"}}")                        # }

print(f"我的名字是 {key} ")           # 我的名字是 Alice




# ---------------------------------------------------------------------------

# +和extend的区别是不是，+只能是相同的数据类型，extend只要是迭代器的都可以合并？
list1 = [1, 2, 3]
list2 = [4, 5, 6]
list3 = ( 4, 5, 6 )
list4 = { 4, 5, 6 }
list5 = "hello"
# list1.extend(list2)
# print(list1)
list1 += list5
print(list1)