
"""
# -------------------------------------------------------------------------------
1.10-1.1 True False为什么用is 判断

# 所以通常只在比较None、True、False等单例对象时使用is
# True False为什么用is呢
# 因为 None True False 都是单例的

print(id(None))
print(id(None))

print(id(True))
print(id(True))

print(id(False))
print(id(False))
"""



"""
# -------------------------------------------------------------------------------
1.10-2.1 int的第 2 个参数表示 进制

str = "10"
print(int(str, 2))
print(int(str, 8))
print(int(str, 10))
print(int(str, 16))

"""



"""
# -------------------------------------------------------------------------------
1.10-2.2 除基取余的 计算过程

print(255 % 16)
print(255 / 16)  # 15.9375
print(255 // 16)  # 15

"""




